{
    "home.herosection.desc1": "I am a full-stack developer specializing in creating scalable and reliable applications.",
    "home.herosection.desc2": "My goal is to help businesses grow through innovative and efficient web solutions.",
    "home.herosection.getInTouch": "GET IN TOUCH",

    "home.about.paragraph1": "I have been working in development for over 2 years and during this time I have mastered technologies like Next.js, React, Nest.js, and many other tools.",
    "home.about.paragraph2": "My strength lies in combining the visual side (frontend) with robust server-side logic (backend) to create fast, user-friendly, and efficient solutions. Continuous learning and striving for improvement are the foundation of my work.",

    "home.workHistory.IPhoner.text1": "The project is an online store for Apple products built with React.js + Redux TK.",
    "home.workHistory.IPhoner.text3": "1. Routing using React-router-dom\n\n2. Product page and API interaction with Axios client\n\n3. Product detail page\n\n4. Cart implemented with Redux-persist for saving the cart in localstorage\n\n5. Trade-in (used device value calculation)\n\n6. Redux/Redux Toolkit, asynchronous actions with Redux-thunk",
    "home.workHistory.IPhoner.text4": "Since this was my first E-commerce project, it was challenging to implement API interactions and work with slices in Redux TK.",
    "home.workHistory.IPhoner.text_block_title1": "About the Project",
    "home.workHistory.IPhoner.text_block_title3": "What Was Implemented?",
    "home.workHistory.IPhoner.text_block_title4": "Challenges",
    "home.workHistory.IPhoner.date": "August 2022 - October 2022",

    "home.workHistory.mervice.text1": "The company is engaged in wholesale trading of batch materials, and the task was to develop a company website and a platform for employee training.",
    "home.workHistory.mervice.text2": "Website for mervice.\n\nI fully developed the frontend using React. The main challenges I faced were implementing scroll animations by slides across devices and adding news, particularly uploading photos. I fixed the scrolling issue by adding a delay and ignoring redundant scroll events, and resolved the photo upload issue using formdata.\n\nBackend was new to me, and understanding how to handle requests and responses was the hardest part. I got acquainted with Express.js and implemented endpoints for the admin panel, which also involved file handling challenges.",
    "home.workHistory.mervice.text3": "I learned about Next.js and ISR, Sass, RTK Query, and TypeScript.\nOn the backend, I explored Express.js (routing, database interactions, endpoint and service creation).\n\nI gained experience working with Git in a team.\n\nI discovered Firebase, and the main challenge was storing files in the storage. It took me many hours to understand how to configure everything correctly, send files, and retrieve them.\n\nThe hardest part was learning and understanding backend principles.",
    "home.workHistory.mervice.text4": "Training Platform.\n\nOn the frontend, I implemented all the logic for quizzes and user statistics. I extensively worked with Redux Toolkit while developing quizzes. The only problem I encountered was with statistics: data often came incorrectly from other modules handled by developers in different time zones, making collaboration difficult. For displaying statistics, I used charts, which turned out to be surprisingly straightforward.",
    "home.workHistory.mervice.text_block_title1": "About the Company",
    "home.workHistory.mervice.text_block_title2": "Project №1",
    "home.workHistory.mervice.text_block_title3": "What's New?",
    "home.workHistory.mervice.text_block_title4": "Project №2",
    "home.workHistory.mervice.date": "November 2022 - January 2024",

    "home.workHistory.TaskSync.text2": "I joined a startup project aimed at developing a web application for task planning, scheduling, and time management using a pomodoro timer.",
    "home.workHistory.TaskSync.text3": "Frontend: Fully implemented a drag-and-drop system for the 'kanban' board and time blocks. I learned about interceptors in Axios for JWT (token validation, refreshing, and attaching tokens in bearer headers) for backend requests.\n\nBackend: Got familiar with Nest.js, its decorators, and architecture. It was easy to adapt to since it resembled Express. I implemented microservices for time blocks and tasks, following the BFF principle.\n\nI explored Prisma for PostgreSQL interactions, which I found to be the most convenient tool I've used so far.",
    "home.workHistory.TaskSync.text4": "The most challenging part was implementing JWT authorization, as it was my first time using this approach. I wrote an endpoint that refreshes and creates new tokens, then sends them to the frontend via cookies.",
    "home.workHistory.TaskSync.text_block_title2": "Startup",
    "home.workHistory.TaskSync.text_block_title3": "What I Worked On",
    "home.workHistory.TaskSync.text_block_title4": "Challenges",
    "home.workHistory.TaskSync.date": "January 2024 - July 2024",

    "home.workHistory.themedik.text1": "A startup project aimed at creating a service to promote personal branding for doctors.",
    "home.workHistory.themedik.text2": "Mainly worked on the backend and with an nginx server.\nOn the frontend, assisted with JWT authorization and setting up doctor profile settings.",
    "home.workHistory.themedik.text3": "Backend: Integrated phone-based authorization using Plusofon and learned how to work with files.\n\nFor the first time, I configured an nginx server from scratch (proxy setup, redirection, configuration writing) and successfully set up an SSL protocol, which was an interesting experience.\n\nOn the frontend, I wrote an interceptor combined with Axios for JWT authorization (token validation requests, token refresh requests, token updates) and created middleware for user token validation.\n\nI also developed a profile settings page for doctors, during which I learned Tailwind.",
    "home.workHistory.themedik.text4": "I served as the team lead on this project since I was the most experienced member. I distributed tasks, planned the team's workflow, and trained a couple of employees in Nest.js.",
    "home.workHistory.themedik.text_block_title1": "About the Project",
    "home.workHistory.themedik.text_block_title2": "Role",
    "home.workHistory.themedik.text_block_title3": "Tasks",
    "home.workHistory.themedik.text_block_title4": "Additional Responsibilities",
    "home.workHistory.themedik.date": "July 2024 - November 2024",

    "home.experience.Frontend.frameworks.react.desc": "2 years of development experience, working with hooks, context, routing, and other React features.",
    "home.experience.Frontend.frameworks.next.desc": "I've been using it for 1.5 years, primarily working with ISR. I'm not a big fan of SSR. :)",
    "home.experience.Frontend.state.redux.desc": "Currently, I mainly use it as a state management tool, but I previously used RTK Query as well.",
    "home.experience.Frontend.styling.css.desc": "Grid, flex, pseudo-classes, global variables – I'm familiar with all of these. :)",
    "home.experience.Frontend.styling.SASS.desc": "A great preprocessor with mixins, variables, hierarchy, and convenient shortcuts – thumbs up!",
    "home.experience.Frontend.Build.Vite.desc": "I build React applications exclusively with Vite. In my opinion, it's much faster and more convenient than webpack.",
    "home.experience.Backend.Frameworks.Nest.desc": "Currently, my favorite backend framework. I've worked with JWT authorization using cookies, created custom decorators, and more. Over a year of experience.",
    "home.experience.Backend.Frameworks.Express.desc": "I used it on just one project before discovering Nest. :)",
    "home.experience.Backend.Database.PostgreSQL.desc": "In my opinion, the most convenient database, especially when paired with Prisma.",
    "home.experience.Backend.Database.Firebase.desc": "I've worked with Storage, Firebase Database, and Realtime Database.",
    "home.experience.Backend.ORM.Prisma.desc": "The most user-friendly tool I've ever used. The most challenging part in my practice was working with transactions.",
    "home.experience.Other.TypeScript.desc": "I've been using it for over 1.5 years, typing everything possible.",
    "home.experience.Other.Git.desc": "A convenient tool for version control.",

    "not-allowed1": "Currently, the application does not support the mobile version 😒",
    "not-allowed2": "You can use your laptop or computer to enjoy my portfolio 😎"
}
